DROP TABLE IF EXISTS Invoices;

CREATE TABLE IF NOT EXISTS Invoices (
    ID INTEGER PRIMARY KEY,
    BillNo TEXT NOT NULL,
    SlipNo TEXT NOT NULL,
    CustomerID TEXT NOT NULL,
    CustomerName TEXT NOT NULL,
    Products TEXT NOT NULL,
    Number INTEGER NOT NULL,
    UnitPrice DECIMAL NOT NULL,
    Date DATE NOT NULL 
);
INSERT INTO
    Invoices (ID,BillNo,SlipNo,CustomerID,CustomerName,Products,Number,UnitPrice,Date)
VALUES
    (1,'WS-DF502','GB465','2ADFG','コンビニエンス北風','コーヒー 250 ml',100,100,'2020-01-05T00:00:00'),
    (2,'WS-DF502','GB465','2ADFG','コンビニエンス北風','紅茶 350 ml',300,120,'2020-01-05T00:00:00'),
    (3,'WS-DF502','DK055','2ADFG','コンビニエンス北風','炭酸飲料 (オレンジ） 350 ml',200,120,'2020-01-09T00:00:00'),
    (4,'DB-00001','7948352','1ADZA','みのり商事','モッツァレッラチーズとトマトのサラダ',1,1200,'2019-02-04T00:00:00'),
    (5,'DB-00001','7948352','1ADZA','みのり商事','モッツァレッラチーズとトマトのサラダ',119,1200,'2019-02-04T00:00:00'),
    (6,'DB-00001','1797382','1ADZA','みのり商事','ナポリ風スパゲティー',1,2500,'2019-02-04T00:00:00'),
    (7,'DB-00001','1797382','1ADZA','みのり商事','ナポリ風スパゲティー',59,2500,'2019-02-04T00:00:00'),
    (8,'DB-00001','9963274','1ADZA','みのり商事','小羊背肉のリンゴソースかけ',1,5000,'2019-02-04T00:00:00'),
    (9,'DB-00001','9963274','1ADZA','みのり商事','小羊背肉のリンゴソースかけ',129,5000,'2019-02-04T00:00:00'),
    (10,'DB-00002','8398400','1BCDS','居酒屋ななべえ','超極厚牛タン',1,4800,'2019-02-08T00:00:00'),
    (11,'DB-00002','8398400','1BCDS','居酒屋ななべえ','超極厚牛タン',129,4800,'2019-02-08T00:00:00'),
    (12,'DB-00002','7079356','1BCDS','居酒屋ななべえ','濃厚ずんだロール',20,780,'2019-02-08T00:00:00'),
    (14,'DB-00003','7627259','3AXDS','レストラン石坂','マスクメロン',90,1100,'2019-02-18T00:00:00'),
    (15,'DB-00003','8238079','3AXDS','レストラン石坂','ラ・フランス',150,700,'2019-02-18T00:00:00')
;